# CircleMultiPlanarShape Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..CircleMultiPlanarShape Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
A circle can't be converted to multiplanar shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircleMultiPlanarShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircleMultiPlanarShape As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircleMultiPlanarShape {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace